_posts/2022-01-08-boj-11437.html
---
layout: post
title: BOJ 11437 LCA
tags: dfs LCA
---

<div id="outline-container-org924635f" class="outline-2">
<h2 id="org924635f">BOJ 11437 LCA</h2>
<div class="outline-text-2" id="text-org924635f">
<ul class="org-ul">
<li>트리에 두 점이 주어질 때 가장 가까운 부모의 번호를 출력하기</li>
</ul>
</div>
</div>

<div id="outline-container-org88a0deb" class="outline-2">
<h2 id="org88a0deb">접근하기</h2>
<div class="outline-text-2" id="text-org88a0deb">
<pre class="example">
1. 인접 리스트로 Graph 형태로 받음. N-1번 받는다.

2. dfs로 1번(root)로부터의 거리만큼을 depth 배열에 저장하고, parent의 번호도 저장한다.
</pre>
</div>
</div>


<div id="outline-container-orge07c61c" class="outline-2">
<h2 id="orge07c61c">코드 - dfs로 풀이 (O(N) - 1128 m/s)</h2>
<div class="outline-text-2" id="text-orge07c61c">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #888a85;">// </span><span style="color: #888a85;">1128 m/s</span>
<span style="color: #729fcf;">#include</span> <span style="color: #ad7fa8; font-style: italic;">&lt;bits/stdc++.h&gt;</span>
<span style="color: #729fcf; font-weight: bold;">using</span> <span style="color: #729fcf; font-weight: bold;">namespace</span> <span style="color: #8ae234;">std</span>;

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">parent</span>[50010];
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">depth</span>[50010];
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">N</span>;
<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">M</span>;

<span style="color: #8ae234; font-weight: bold;">vector</span>&lt;<span style="color: #8ae234; font-weight: bold;">int</span>&gt; <span style="color: #ff6347;">G</span>[50010];

<span style="color: #8ae234; font-weight: bold;">void</span> <span style="color: #edd400; font-weight: bold;">dfs</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">idx</span>, <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">k</span>)
{
    depth[idx] = k;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #729fcf; font-weight: bold;">auto</span>&amp;<span style="color: #ff6347;">next</span> :G[idx]) {
        <span style="color: #729fcf; font-weight: bold;">if</span> (depth[next] == 0) {
            parent[next] = idx; 
            dfs(next, k+1);
        }
    }
}

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">LCA</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">p1</span>, <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">p2</span>)
{
    <span style="color: #729fcf; font-weight: bold;">if</span> (p1 == p2) <span style="color: #729fcf; font-weight: bold;">return</span> p1; 

    <span style="color: #729fcf; font-weight: bold;">if</span> (depth[p1] &gt; depth[p2]) {
        <span style="color: #729fcf; font-weight: bold;">return</span> LCA(parent[p1], p2); 
    } <span style="color: #729fcf; font-weight: bold;">else</span> <span style="color: #729fcf; font-weight: bold;">if</span> (depth[p1] &lt; depth[p2]) {
        <span style="color: #729fcf; font-weight: bold;">return</span> LCA(p1, parent[p2]); 
    } <span style="color: #729fcf; font-weight: bold;">else</span> <span style="color: #729fcf; font-weight: bold;">if</span>(depth[p1] == depth[p2]) {
        <span style="color: #729fcf; font-weight: bold;">return</span> LCA(parent[p1], parent[p2]);
    }
    <span style="color: #729fcf; font-weight: bold;">return</span> p1;
}

<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">main</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">argc</span>, <span style="color: #8ae234; font-weight: bold;">char</span>* <span style="color: #ff6347;">argv</span>[])
{
    scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;N);
    <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">p1</span>, <span style="color: #ff6347;">p2</span>;
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;N-1;i++) {
        scanf(<span style="color: #ad7fa8; font-style: italic;">"%d %d"</span>, &amp;p1, &amp;p2);
        G[p1].push_back(p2);
        G[p2].push_back(p1);
    } 
    parent[1] = 1; 
    dfs(1, 1);

    scanf(<span style="color: #ad7fa8; font-style: italic;">"%d"</span>, &amp;M);
    <span style="color: #729fcf; font-weight: bold;">for</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">i</span>=0;i&lt;M;i++) {
        scanf(<span style="color: #ad7fa8; font-style: italic;">"%d %d"</span>, &amp;p1, &amp;p2); 
        <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">ret</span> = LCA(p1, p2);
        printf(<span style="color: #ad7fa8; font-style: italic;">"%d\n"</span>, ret);
    }
    <span style="color: #729fcf; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org88966e8" class="outline-2">
<h2 id="org88966e8">dfs로 풀이 - LCA를 iterative로 1128 m/s</h2>
<div class="outline-text-2" id="text-org88966e8">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #edd400; font-weight: bold;">LCA</span>(<span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">p1</span>, <span style="color: #8ae234; font-weight: bold;">int</span> <span style="color: #ff6347;">p2</span>)
{
    <span style="color: #729fcf; font-weight: bold;">while</span>(p1 != p2) {
        <span style="color: #729fcf; font-weight: bold;">if</span> (depth[p1] &gt; depth[p2]) {
            p1 = parent[p1];
        } <span style="color: #729fcf; font-weight: bold;">else</span> <span style="color: #729fcf; font-weight: bold;">if</span> (depth[p1] &lt; depth[p2]) {
            p2 = parent[p2];
        } <span style="color: #729fcf; font-weight: bold;">else</span> <span style="color: #729fcf; font-weight: bold;">if</span>(depth[p1] == depth[p2]) {
            p1 = parent[p1];
            p2 = parent[p2];
        }
    }
    <span style="color: #729fcf; font-weight: bold;">return</span> p1;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org681efc2" class="outline-2">
<h2 id="org681efc2">문제 링크</h2>
<div class="outline-text-2" id="text-org681efc2">
<ul class="org-ul">
<li><a href="https://www.acmicpc.net/problem/11437">https://www.acmicpc.net/problem/11437</a></li>
</ul>
</div>
</div>
